df.isnull()
    True ข้อมูลไม่ครบ
    False ข้อมูลครบ
df.isnull().any()   หาคอลัม์ใดที่มีค่าว่าง
df.isnull().sum()   มีค่าว่างกี่เเถว

df.notnull()
    True ข้อมูลครบ
    False ข้อมูลไม่ครบ
df.notnull().any()   หาคอลัม์ใดที่ข้อมูลครบ
df.notnull().sum()   มีข้อมูลครบถ้วนกี่เเถว

In [1]:
import pandas as pd
df = pd.read_excel("Employee.xlsx")

In [2]:
df

             Name         Job   Age    Salary  Bonus  Address
0         อาทิตย์  Programmer  20.0   30000.0    0.1      NaN
1   เกียรติศักดิ์  Programmer  18.0       NaN    0.1      NaN
2        จักรพงษ์   Developer   NaN   32000.0    0.1      NaN
3          สุรชัย         NaN  23.0   40000.0    0.1      NaN
4            ทศพล        Sale  29.0   40000.0    0.1      NaN
5          จินตนา     Manager   NaN  450000.0    0.1      NaN
6             NaN         NaN   NaN       NaN    NaN      NaN
7       เกษมสันต์    Maketing  34.0   60000.0    0.1      NaN
8          ชลธิชา         NaN  26.0  100000.0    0.1      NaN
9       เกษมสันต์    Maketing  34.0   60000.0    0.1      NaN
10           ทศพล        Sale  29.0   40000.0    0.1      NaN

In [5]:
df.isnull()

     Name    Job    Age  Salary  Bonus  Address
0   False  False  False   False  False     True
1   False  False  False    True  False     True
2   False  False   True   False  False     True
3   False   True  False   False  False     True
4   False  False  False   False  False     True
5   False  False   True   False  False     True
6    True   True   True    True   True     True
7   False  False  False   False  False     True
8   False   True  False   False  False     True
9   False  False  False   False  False     True
10  False  False  False   False  False     True

In [6]:
df.isnull().any()

Name       True
Job        True
Age        True
Salary     True
Bonus      True
Address    True
dtype: bool

In [7]:
df.isnull().sum()

Name        1
Job         3
Age         3
Salary      2
Bonus       1
Address    11
dtype: int64

In [8]:
df.notnull()

     Name    Job    Age  Salary  Bonus  Address
0    True   True   True    True   True    False
1    True   True   True   False   True    False
2    True   True  False    True   True    False
3    True  False   True    True   True    False
4    True   True   True    True   True    False
5    True   True  False    True   True    False
6   False  False  False   False  False    False
7    True   True   True    True   True    False
8    True  False   True    True   True    False
9    True   True   True    True   True    False
10   True   True   True    True   True    False

In [9]:
df.notnull().sum()

Name       10
Job         8
Age         8
Salary      9
Bonus      10
Address     0
dtype: int64